app/controllers/abouts_controller.rb

SELECT "abouts".* FROM "abouts"
---
  def index
    @abouts = About.all

DELETE FROM "abouts" WHERE "abouts"."id" = $1  [["id", 7]]
---
  def destroy
    @about.destroy

SELECT "abouts".* FROM "abouts" WHERE "abouts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def set_about
      @about = About.find(params[:id])