app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("site", "url", "icon", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["site", "LinkedIn"], ["url", "https://www.linkedin.com/in/cambui/"], ["icon", ""], ["created_at", "2021-04-07 03:35:48.175823"], ["updated_at", "2021-04-07 03:35:48.175823"]]